tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionLiquidHeater/constant/bottomWater/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType hRhoThermo<pureMixture<constTransport<specieThermo<hConstThermo<incompressible>>>>>;
mixture         water 1 18 1000 4181 0 959e-6 6.62;

// thermoType hRhoThermo<pureMixture<icoPoly3ThermoPhysics>>;
// mixture
//     water 1 18
//     rhoPolynomial (1000 0 0)
//     0
//     0
//     CpPolynomial (4181 0 0)
//     muPolynomial (959e-6 0 0)
//     kappaPolynomial (145e-6 0 0)
// ;

// ************************************************************************* //
