tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionLiquidHeater/system/rightSolid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        minZ
        {
            type            patch;
        }
        maxZ
        {
            type            patch;
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 300;
            }
            "rightSolid_to_.*"
            {
                type            compressible::turbulentTemperatureCoupledBaffleMixed;
                neighbourFieldName T;
                Kcond           Kcond;
                value           uniform 300;
            }
        }
    }

    rho
    {
        internalField   uniform 8000;

        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 8000;
            }
        }
    }

    Kcond
    {
        internalField   uniform 80;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 80;
            }
        }
    }

    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 450;
            }
        }
    }
}

// ************************************************************************* //
